YES_NO_OPTIONS = {"Да!": True, "Нет..": False}

HELLO = (
    "Привет! С помощью этого бота мы будем случайно разыгрывать *рюкзаки* среди участников.\n"
    "Нужно только зарегистрироваться.\n"
    "А еще бот умеет призывать тебя на активности на стенде и рассказывать о Яндекс 360\n"
    "Ну, если тебе интересно."
)

INTRODUCE_YOURSELF = "Напиши, пожалуйста, как тебя зовут и из какой ты компании."
INTRODUCE_YOUR_EXP = "Твой опыт в Java (ответь числом лет)"
INVALID_EXP = "Вы ввели невалидное значение, ожидалось целое число или число с плавающей точкой"
INTRODUCE_SUBSCRIBE = (
    "Ты готов получать *1 ненавязчивый email в квартал* о Яндекс 360: статьи и доклады от нас про Java и архитектуру?\n"
    "Нажимая на \"Да\" Вы дёте согласие ООО \"Яндекс\" (119021, Россия, г. Москва,  ул. Льва Толстого, д. 16) и его "
    "аффилированным лицам на обработку  Ваших персональных данных в целях направления Вам рассылок)\n"
    "[Условие проведения конкурса](https://yandex.ru/legal/competition_generalterms/)"
)
INTRODUCE_MAIL = "Тогда оставь свою почту, пожалуйста"

INVALID_EMAIL = "Вы ввели невалидный почтовый адрес"
# subscribe
SUBSCRIBE_MSG = "Хотите подписаться на новости Яндекс 360?"
FINISH_REGISTRATION = "Чтобы участвовать в розыгрыше нажми на кнопку \"Участвую\""
PARTICIPATE = (
    "Круто! Ты зарегистрировался на розыгрыш призов.\n"
    "Победителя мы выбираем случайным образом.\n"
    "Если выиграешь, то мы обязательно оповестим тебя через бота."
)

ALREADY_PARTICIPATE = (
    "Кажется, ты уже зарегистрировался в нашем конкурсе. Тебе не нужно регистрироваться снова.\n"
    "Если у тебя возникнут вопросы или тебе нужна помощь, не стесняйся приходи к нам на стенд."
)

ABOUT_INFO = (
    "Мы в Яндекс 360 создаем сервисы для решения повседневных задач, от переписки по работе до хранения"
    " видео из отпуска.\n\n В Яндекс 360 входят аж 11 продуктов: "
    "Почта, Диск, Документы, Телемост, Календарь, Заметки, Рассылки, Мессенджер, Трекер, Вики и Формы.\n\n"
    "У нас много команд разработки: есть, где разгуляться. Разаработчики работают в 2 направлениях: B2B и B2C."
)

ABOUT_INFO_2_BTN = "Вот, кого мы сейчас ищем"
ABOUT_INFO_LINK = "https://ya.cc/t/gCxLUTiv4wxddL"
WELCOME = "Приходи к нам на стенд пообщаться 😊"

STAND_INFO = (
    "На стенде мы предлагаем:\n"
    "– Фан: закинуть письма в почтовый ящик\n"
    "– Интерактив: заполнить календарь разработчика полезными встречами\n"
    "– На подумать: спроектировать архитектуру приложения (можно получить рюкзак)"
)

BASE_OPTIONS = {"Участвую": "prize", "Команда": "team", "Стенд": "info"}

GUEST = 'guest'
EMAIL = 'email'
SUBSCRIBE = 'subscribe'

ADMINS = [
    'klebadev',
    'edddoubled',
    'omgitsarina27'
]
